# FieldBuilder Constructor (FieldBuilder) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder Constructor (FieldBuilder)
FieldBuilder Class See Also
---
Constructs a new copy of the input ESFieldBuilder object.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FieldBuilder(
	FieldBuilder other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As FieldBuilder _
)
```

Visual C++
---
```text
public:
FieldBuilder(
	FieldBuilder^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..FieldBuilder
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FieldBuilder Class
FieldBuilder Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace